<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"web2/production","backend":"21279cb31e9e9797dbe173406565da74465dc8d1ca64f8520f2cbc69be1d071a","plan_job_ref":"Job Generate OpenTofu Plan #39 at https://github.com/alexangc/test-vercel-backend-hello-world-iac/actions/runs/21521512339","plan_out_hash":"70146589943af97618232c59da8f37fcbae22dc83263304a60b2d4b8ebc726e1","plan_hash":"8ff61db46bf891705f2785bec2d895789bc23e573a605604f5ad79e3ddd35385","plan_text_format":"diff","version":"2.2.3","closed":true} -->
OpenTofu plan for __web2/production__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place (current -> planned)

OpenTofu will perform the following actions:

  # vercel_project.my_project will be updated in-place
!~  resource "vercel_project" "my_project" {
+       build_machine_type                                = (known after apply)
!~      dev_command                                       = "echo 'hello world (production env) ' && npm run dev" -> "echo 'hello world (web 2 --- production env) ' && npm run dev"
+       enable_preview_feedback                           = (known after apply)
+       git_provider_options                              = (known after apply)
        id                                                = "prj_4igk5rFnp5HoO3YeuZjbFLg4lDhQ"
        name                                              = "web2"
+       preview_comments                                  = (known after apply)
+       protection_bypass_for_automation_secret           = (sensitive value)
!~      resource_config                                   = {
+           function_default_cpu_type = (known after apply)
+           function_default_timeout  = (known after apply)
#            (2 unchanged attributes hidden)
        }
!~      serverless_function_region                        = "iad1" -> (known after apply)
+       team_id                                           = (known after apply)
#        (18 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Apply OpenTofu Plan #22](https://github.com/alexangc/test-vercel-backend-hello-world-iac/actions/runs/21521545867)